<html>
<HEAD><title>MGED commands: vdraw</title></head>
<body>
<h1>NAME</h1>
<p>
vdraw - edit and display vlists from the MGED command line
<h1>SYNOPSIS</h1>
<p>
<b>vdraw o(pen)|w(rite)|i(nsert)|d(elete)|p(arams)|r(ead)|v(list)|s(how)
args</b>
<h1>DESCRIPTION</h1>
<p>
Solids are displayed in MGED using vlists. These are are lists of
commands and vectors which draw lines and polygons.
The <b>vdraw</b> command allows the user to edit
vlists from the command line and then display them in the MGED display
window as "pseudosolids" -- vestigial entries in the
in-memory list of displayed solids which have a name, color, and a display
list, but which do not represent geometry.
<p>
The
vectors in the vlist can represent points or normal vectors defining
lines and polygons; the interpretation of each vector depends on the integer
command which accompanies it. The following commands are defined in
<file>raytrace.h</file>:
<pre>
      NAME            COMMAND          MEANING

RT_VLIST_LINE_MOVE       0         begin new line
RT_VLIST_LINE_DRAW       1         draw line to this point
RT_VLIST_POLY_START      2         give surface normal for polygon
RT_VLIST_POLY_MOVE       3         first polygon vertex
RT_VLIST_POLY_DRAW       4         subsequent polygon vertex
RT_VLIST_POLY_END        5         last polygon vertex (repeat first)
RT_VLIST_POLY_VERTNORM   6         per-vertex normal (for interpolation)
</pre>
<b>Vdraw</b> can take a variety of arguments which specify various
operations on the vlists. Note that any textual argument can be
replaced by its first letter. For example, <b>vdraw d a</b> has the same
effect as <b>vdraw delete all</b>.
<p>
In the following descriptions,
<i>index</i> is an integer referring to a particular node in a vlist,
<i>command</i> is an integer representing one of the drawing commands
described above, <i>name</i> is a string no longer than 31 characters,
and <i>rrggbb</i> is a six-digit hexidecimal integer representing a
color.
<h1>OPERATIONS</h1>

<pre>
vdraw open
</pre>
With no argument, this command asks whether or not any vlist is
currently open. Returns "1" if yes, "0" if no. The <b>vdraw</b>
function keeps at most one vlist open at any time - this is the vlist
which is operated on by all of the other commands. All other commands,
except the <b>vdraw vlist</b> commands, return an error if there is no open
vlist.
<pre>
vdraw open <i>name</i>
</pre>
Open the named vlist for editing, creating a new vlist if it doesn't
already exist, and closing the previous vlist.
Returns 1 if creating
a new vlist, or 0 otherwise.
<pre>
vdraw write <i>index command x y z</i>
</pre>
Write the given command and vector into the <i>index</i>-th node of the
current vlist.
The existing nodes are numbered from 0 to
<i>n-1</i>, where <i>n</i>
is the length of the vlist. If the index is in the range 0
to <i>n</i>, there is no return value; otherwise an error message is returned.
<pre>
vdraw write next <i>command x y z</i>
</pre>
Append the given command and vector to the end of the current vlist.
No return value.
<pre>
vdraw insert <i>index command x y z</i>
</pre>
Insert the given command and vector in front of the <i>index</i>-th node
of the current vlist. Returns an error if the <i>index</i> is not in
the range 0 to <i>n</i>, where <i>n</i> is the length of the vlist.
<pre>
vdraw delete <i>index</i>
</pre>
Delete the <i>index</i>-th node from the current vlist. Returns an error
if <i>index</i> is not in the range 0 to <i>n-1</i>.
<pre>
vdraw delete last
</pre>
Delete the last node from the current vlist. Returns an error if the
current vlist is empty.
<pre>
vdraw delete all
</pre>
Delete all of the nodes from the current vlist.
<pre>
vdraw params color <i>rrggbb</i>
</pre>
Set the color parameter of the current vlist with a six-digit
hexidecimal integer.
<pre>
vdraw params name <i>name</i>
</pre>
Set the name of the current vlist to <i>name</i>. Returns an error if a
vlist with the given name already exists.
<pre>
vdraw read <i>index</i>
</pre>
Returns the contents of the <i>index</i>-th node of the current vlist,
in the order <i>command x y z</i>. Returns an error if the node does not
exist.
<pre>
vdraw read color
</pre>
Returns the six-digit hexidecimal integer representing the color of the
current vlist.
<pre>
vdraw read length
</pre>
Returns the length of the current vlist.
<pre>
vdraw read name
</pre>
Returns the name of the current vlist.
<pre>
vdraw send
</pre>
Displays the current vlist by creating a pseudosolid. If the name of the
vlist is <i>name</i>, then <b>vdraw</b> will create a pseudosolid named
_VDRW<i>name</i>, replacing any existing pseudosolid with the same
name. If a true solid with that name exists, "-1" is returned and the
vlist is not displayed. A "0" is returned if the vlist is successfully
displayed.
<pre>
vdraw vlist list
</pre>
Returns a list containing the names of all of the vlists being maintained
by <b>vdraw</b>, or an
empty string if there are no vlists.
<pre>
vdraw vlist delete <i>name</i>
</pre>
Deletes the named vlist. If the vlist doesn't exist, an error is
returned. Note that this only deletes the copy of the vlist maintained
by <b>vdraw</b> -- the corresponding pseudosolid, if it exists, is not
automatically deleted.

<h1>EXAMPLES</h1>
<p>
Open a vlist called "triangle", and read its initial name and length.
<pre>
mged> vdraw o triangle
1
mged> vdraw r n
triangle
mged> vdraw r l
0
</pre>

Add the normal vector and defining points to the list, then display it.
<pre>
mged> vdraw w n 2 0.0 0.0 1.0
mged> vdraw w n 3 0.0 0.0 0.0
mged> vdraw w n 4 10.0 0.0 0.0
mged> vdraw w n 4 0.0 10.0 0.0
mged> vdraw w n 5 0.0 0.0 0.0
mged> vdraw r l
5
mged> vdraw s
0
</pre>

Display it in red.
<pre>
mged> vdraw p c ff0000
mged> vdraw s
0
</pre>
<hr>
<address>Last updated July 8, 1997</address>
</body>
</html>
